{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Add missing BioProjects\n",
    "\n",
    "- Patch 16534 bioprojects that were missing from Logan database in bioprojects table\n",
    "- Call NCBI to retrieve missing info\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "import xml.etree.ElementTree as ET\n",
    "import time\n",
    "\n",
    "if '../' not in sys.path:\n",
    "    sys.path.append(\"../\")\n",
    "%reload_ext dotenv\n",
    "%dotenv\n",
    "\n",
    "from queries import serratus_queries, logan_queries\n",
    "from datasources.neo4j import get_connection\n",
    "\n",
    "from Bio import Entrez"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "63\n"
     ]
    }
   ],
   "source": [
    "def get_runs_with_missing_bioproject():\n",
    "    neo4j = get_connection()\n",
    "    query = '''\n",
    "        MATCH (n:SRA)\n",
    "        WHERE NOT (n)-[:HAS_BIOPROJECT]->() AND n.bioProject IS NOT NULL\n",
    "        RETURN DISTINCT n.bioProject\n",
    "    '''\n",
    "    return neo4j.query(query)\n",
    "\n",
    "missing = get_runs_with_missing_bioproject()\n",
    "print(len(missing))\n",
    "# 16534"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 PRJEB40027\n",
      "1 PRJNA170677\n",
      "No details found for PRJNA170677\n",
      "2 PRJNA173491\n",
      "No details found for PRJNA173491\n",
      "3 PRJNA176872\n",
      "No details found for PRJNA176872\n",
      "4 PRJNA198686\n",
      "No details found for PRJNA198686\n",
      "5 PRJNA20965\n",
      "No details found for PRJNA20965\n",
      "6 PRJNA222417\n",
      "No details found for PRJNA222417\n",
      "7 PRJNA241409\n",
      "No details found for PRJNA241409\n",
      "8 PRJNA261660\n",
      "No details found for PRJNA261660\n",
      "9 PRJNA290844\n",
      "No details found for PRJNA290844\n",
      "10 PRJNA295687\n",
      "No details found for PRJNA295687\n",
      "11 PRJNA297265\n",
      "No details found for PRJNA297265\n",
      "12 PRJNA327834\n",
      "No details found for PRJNA327834\n",
      "13 PRJNA352040\n",
      "No details found for PRJNA352040\n",
      "14 PRJNA371783\n",
      "No details found for PRJNA371783\n",
      "15 PRJNA377138\n",
      "No details found for PRJNA377138\n",
      "16 PRJNA391175\n",
      "No details found for PRJNA391175\n",
      "17 PRJNA398653\n",
      "No details found for PRJNA398653\n",
      "18 PRJNA415907\n",
      "No details found for PRJNA415907\n",
      "19 PRJNA422288\n",
      "No details found for PRJNA422288\n",
      "20 PRJNA422297\n",
      "No details found for PRJNA422297\n",
      "21 PRJNA428835\n",
      "No details found for PRJNA428835\n",
      "22 PRJNA448876\n",
      "No details found for PRJNA448876\n",
      "23 PRJNA481563\n",
      "No details found for PRJNA481563\n",
      "24 PRJNA486784\n",
      "No details found for PRJNA486784\n",
      "25 PRJNA487161\n",
      "No details found for PRJNA487161\n",
      "26 PRJNA487256\n",
      "No details found for PRJNA487256\n",
      "27 PRJNA506227\n",
      "No details found for PRJNA506227\n",
      "28 PRJNA521726\n",
      "No details found for PRJNA521726\n",
      "29 PRJNA526884\n",
      "No details found for PRJNA526884\n",
      "30 PRJNA528749\n",
      "No details found for PRJNA528749\n",
      "31 PRJNA544465\n",
      "No details found for PRJNA544465\n",
      "32 PRJNA545899\n",
      "No details found for PRJNA545899\n",
      "33 PRJNA546588\n",
      "No details found for PRJNA546588\n",
      "34 PRJNA552212\n",
      "No details found for PRJNA552212\n",
      "35 PRJNA556412\n",
      "No details found for PRJNA556412\n",
      "36 PRJNA559860\n",
      "No details found for PRJNA559860\n",
      "37 PRJNA560550\n",
      "No details found for PRJNA560550\n",
      "38 PRJNA576144\n",
      "No details found for PRJNA576144\n",
      "39 PRJNA588146\n",
      "No details found for PRJNA588146\n",
      "40 PRJNA616319\n",
      "No details found for PRJNA616319\n",
      "41 PRJNA627897\n",
      "No details found for PRJNA627897\n",
      "42 PRJNA632539\n",
      "No details found for PRJNA632539\n",
      "43 PRJNA642796\n",
      "No details found for PRJNA642796\n",
      "44 PRJNA664622\n",
      "No details found for PRJNA664622\n",
      "45 PRJNA672916\n",
      "No details found for PRJNA672916\n",
      "46 PRJNA683127\n",
      "No details found for PRJNA683127\n",
      "47 PRJNA692298\n",
      "No details found for PRJNA692298\n",
      "48 PRJNA702472\n",
      "No details found for PRJNA702472\n",
      "49 PRJNA722741\n",
      "No details found for PRJNA722741\n",
      "50 PRJNA728441\n",
      "No details found for PRJNA728441\n",
      "51 PRJNA756287\n",
      "No details found for PRJNA756287\n",
      "52 PRJNA756288\n",
      "No details found for PRJNA756288\n",
      "53 PRJNA756290\n",
      "No details found for PRJNA756290\n",
      "54 PRJNA756462\n",
      "No details found for PRJNA756462\n",
      "55 PRJNA781266\n",
      "No details found for PRJNA781266\n",
      "56 PRJNA817163\n",
      "No details found for PRJNA817163\n",
      "57 PRJNA843947\n",
      "No details found for PRJNA843947\n",
      "58 PRJNA844296\n",
      "No details found for PRJNA844296\n",
      "59 PRJNA854623\n",
      "No details found for PRJNA854623\n",
      "60 PRJNA857516\n",
      "No details found for PRJNA857516\n",
      "61 PRJNA857650\n",
      "No details found for PRJNA857650\n",
      "62 PRJNA858865\n",
      "No details found for PRJNA858865\n",
      "63 PRJNA912216\n",
      "No details found for PRJNA912216\n"
     ]
    }
   ],
   "source": [
    "Entrez.email = 'lj.pereira@mail.utoronto.ca'\n",
    "\n",
    "\n",
    "\n",
    "escapes = ''.join([chr(char) for char in range(1, 32)])\n",
    "translator = str.maketrans('', '', escapes)\n",
    "\n",
    "def get_bioproject_details(bioproject):\n",
    "    handle = Entrez.esearch(db='bioproject', term=bioproject)\n",
    "    search_record = Entrez.read(handle)\n",
    "    handle.close()\n",
    "    if search_record['Count'] == '0':\n",
    "        return None\n",
    "    handle = Entrez.esummary(db='bioproject', id=search_record['IdList'][0])\n",
    "\n",
    "    summary_record = Entrez.read(handle)\n",
    "    handle.close()\n",
    "    document = summary_record['DocumentSummarySet']['DocumentSummary'][0]\n",
    "\n",
    "    resp = {\n",
    "        'bioproject': bioproject,\n",
    "        'title': None,\n",
    "        'description': None,\n",
    "        'name': None\n",
    "    }\n",
    "\n",
    "    def clean_text(text):\n",
    "        # escape quotes\n",
    "        # escale escape characters\n",
    "        text = text.translate(translator)\n",
    "        text = text.replace('\\\\', '')\n",
    "        text = text.replace('\"', \"'\")\n",
    "        text = text.replace('\\r', ' ')\n",
    "        text = text.replace('\\t', ' ')  \n",
    "        text = text.replace('\\n', ' ')\n",
    "        return text\n",
    "    \n",
    "\n",
    "    if 'Project_Title' in document:\n",
    "        resp['title'] = clean_text(document['Project_Title'])\n",
    "    if 'Project_Description' in document:\n",
    "        resp['description'] = clean_text(document['Project_Description'])\n",
    "    if 'Project_Name' in document:\n",
    "        resp['name'] = clean_text(document['Project_Name'])\n",
    "    \n",
    "    return resp\n",
    "\n",
    "def create_bioproject_node(bioproject_details):\n",
    "    neo4j = get_connection()\n",
    "    query = f'''\n",
    "        MERGE (b:BioProject {{bioProject: \"{bioproject_details['bioproject']}\" }} )\n",
    "        SET b += {{\n",
    "            title: \"{bioproject_details['title']}\",\n",
    "            description: \"{bioproject_details['description']}\",\n",
    "            name: \"{bioproject_details['name']}\"\n",
    "        }}\n",
    "    '''\n",
    "    return neo4j.query(query)\n",
    "\n",
    "\n",
    "def create_bioproject_relationships(bioproject):\n",
    "    neo4j = get_connection()\n",
    "    query = f'''\n",
    "        MATCH (n:SRA {{bioProject: \"{bioproject}\"}})\n",
    "        MATCH (b:BioProject {{bioProject: \"{bioproject}\"}})\n",
    "        MERGE (n)-[:HAS_BIOPROJECT]->(b)\n",
    "    '''\n",
    "    return neo4j.query(query)\n",
    "\n",
    "# handle 429: Too Many Requests rate limit\n",
    "last_completed_time = time.time()\n",
    "for i, record in enumerate(missing):\n",
    "    time.sleep(0.5)\n",
    "    bioproject = record['n.bioProject']\n",
    "    details = get_bioproject_details(bioproject)\n",
    "    print(i, bioproject)\n",
    "\n",
    "    if not details:\n",
    "        print(f'No details found for {bioproject}')\n",
    "        continue\n",
    "    create_bioproject_node(details)\n",
    "    create_bioproject_relationships(bioproject)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Reading local cached file /mnt/graphdata/query_cache/sql/sql_sra_nodes.csv\n",
      "Reading local cached file /mnt/graphdata/query_cache/sql/sql_bioproject_nodes.csv\n",
      "Reading local cached file /mnt/graphdata/query_cache/sql/sql_biosample_nodes.csv\n"
     ]
    }
   ],
   "source": [
    "df_sra = serratus_queries.get_sra_df()\n",
    "df_bioproject = logan_queries.get_bioproject_df()\n",
    "df_biosample = logan_queries.get_biosample_df()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "rnalab",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
